Revit 2027 API
ElectricalSetting.RemoveDistributionSysType Method
 Remove an existing distribution system type from the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveDistributionSysType(
	DistributionSysType distributionSysType
)
Public Sub RemoveDistributionSysType (
	distributionSysType As DistributionSysType
)
public:
void RemoveDistributionSysType(
	DistributionSysType^ distributionSysType
)
member RemoveDistributionSysType :
        distributionSysType : DistributionSysType -> unit
Parameters
distributionSysType DistributionSysType
Exceptions
Exception | Condition
InvalidOperationException |  Distribution system type can be removed only if it is not currently assigned to any devices, otherwise an exception will be thrown.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace